#!/bin/bash

echo "ls 명령어 helper에 오신 것을 환영합니다.\n"
echo "커서를 이동하여 원하시는 옵션을 선택해주세요.\n"

 echo "┌────────────────────────────────────────────────────────────────────┐"
 echo "│                                                                    │"
 echo "│   모든 파일과 디렉토리 출력하기 (숨긴 파일 및 디렉토리 포함)       │"
 echo "│                                                                    │"
 echo "│   권한, 소유자, 소유 그룹, 크기, 수정시간 등의 자세한 정보 출력하기│"
 echo "│                                                                    │"
 echo "│   파일 및 디렉토리 이름의 끝에 항목의 유형을 표시하여 출력하기     │"
 echo "│                                                                    │"
 echo "│   알파벳 역순으로 정렬하여 출력하기                                │"
 echo "│                                                                    │"
 echo "│   파일 및 디렉토리의 수정시간 순으로 정렬하여 출력하기             │"
 echo "│                                                                    │"
 echo "│   파일 및 디렉토리의 크기 순으로 정렬하여 출력하기                 │"
 echo "│                                                                    │"
 echo "└────────────────────────────────────────────────────────────────────┘"
 
 